In [3]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [4]:
ser1 = Series([0,1,2],index=['a','b','c'])

In [5]:
ser1

a    0
b    1
c    2
dtype: int64

In [10]:
ser2 = Series([3,4,5,6],index=['a','b','c','d'])

In [11]:
ser2

a    3
b    4
c    5
d    6
dtype: int64

In [12]:
ser1+ser2

a    3.0
b    5.0
c    7.0
d    NaN
dtype: float64

In [13]:
df1 = DataFrame(np.arange(4).reshape((2,2)),columns=list('ab'),index=['ny','tx'])

In [14]:
df1

    a  b
ny  0  1
tx  2  3

In [15]:
df2 = DataFrame(np.arange(9).reshape((3,3)),columns=list('adc'),index=['ny','tx','la'])

In [16]:
df2

    a  d  c
ny  0  1  2
tx  3  4  5
la  6  7  8

In [17]:
df1+df2

      a   b   c   d
la  NaN NaN NaN NaN
ny  0.0 NaN NaN NaN
tx  5.0 NaN NaN NaN

In [18]:
df1

    a  b
ny  0  1
tx  2  3

In [19]:
df1.add(df2,fill_value=0)

      a    b    c    d
la  6.0  NaN  8.0  7.0
ny  0.0  1.0  2.0  1.0
tx  5.0  3.0  5.0  4.0

In [20]:
df2

    a  d  c
ny  0  1  2
tx  3  4  5
la  6  7  8

In [21]:
df1

    a  b
ny  0  1
tx  2  3

In [22]:
ser3 = df2.ix[0]

C:\ProgramData\Anaconda2\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [23]:
ser3

a    0
d    1
c    2
Name: ny, dtype: int32

In [24]:
df2-ser3

    a  d  c
ny  0  0  0
tx  3  3  3
la  6  6  6